# Homebrew Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# ------------------
#
#    Applications
#
# ------------------


cask "alfred"
cask "atom"
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus"
cask "discord"
cask "docker"
brew "ext4fuse"
cask "firefox"
cask "grammarly"
cask "iterm2"
brew "lastpass-cli"
cask "lastpass"
cask "osxfuse"
cask "xquartz"

# ----------------------------
#
#   Shells, CLI Tools, etc.
#
# ----------------------------

brew "asciinema"
brew "bash-completion@2"
brew "bash"
brew "bat"
brew "binutils"
brew "coreutils"
brew "editorconfig"
brew "exa"
brew "fd"
brew "fish"
brew "gcc"
brew "gcutil"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "gnutls"
brew "jq"
tap "jzaleski/jzaleski"
brew "jzaleski/jzaleski/apg"
brew "kubectx"
brew "kubernetes-cli"
brew "m4"
brew "make"
brew "mycli"
brew "mysql", restart_service: :changed
brew "openssh"
brew "perl"
brew "perltidy"
brew "prettier"
brew "pv"
brew "ranger"
brew "shpotify"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "wget"
brew "yarn", ignore_dependencies: true
